# RailPathCloseLoopForExtensionWarning Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..RailPathCloseLoopForExtensionWarning Property
BuiltInFailures..::..StairRampFailures Class See Also
---
The rail path is closed at the start and end path point for extension creation.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId RailPathCloseLoopForExtensionWarning { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RailPathCloseLoopForExtensionWarning As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ RailPathCloseLoopForExtensionWarning {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace